docs/log-dev.org
#+Title: Gjennomgang av KHFunction
#+Date: 21.10.2020

#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+LANGUAGE: no

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>

#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>


* Generell info
Filen =khfun_dev.R= brukes og er en utvikling versjon for filen =khfunction.R=. Alternative å kunne
kjøre test gjøres ved å spesifisere følgende i =SePaaFil_dev.R= filen:
 - ~runtest=TRUE~ for å bruke test kopi av Access DB
 - ~testfil=TRUE~ i =LagFilgruppe= funksjon for å velge et spesifikk fil i original filer for testing
* KHfunction_20200604_dev.R
- Bytt =reshape2= pakke med =data.table::melt=
- Legg =test= arg i =LagFilgruppe= for å kunne velge originalfil for testing i /ORIGINALFILER/ tabellen.
- Lagt =ht2= funksjon for å vise /head/ og /tail/ i data.frame
- Oppdatere kode 
#+BEGIN_SRC R
  if (TomRadSlutt = TRUE){
    ## OBS! restructure for checking
    ## -----------------------------
    ## Find where empty row starts
    totMiss <- rowSums(DF == "")
    totNA <- rowSums(is.na(DF))
    tomr1 <- which(totMiss == ncol(DF))
    tomr2 <- which(totNA == ncol(DF))
    tomr3 <- c(tomr1, tomr2) #same as tomr below

    ## Alternativ with apply and faster
    ## row.names(DF[apply(DF=="", 1, all),])
    tnames <- rownames(DF[apply(is.na(DF) | DF == "", 1, all), ])
    tomr4 <- which(rownames(DF) %in% tnames)
  }

  ## Original code
  tomr<-which(rowSums(is.na(DF) | DF=="") == ncol(DF))
  if (!is.na(tomr[1])){
    DF<-DF[1:(tomr[1]-1),]
  #+END_SRC


* TODO Options [1/3]
Disse skal implementeres etterhvert:

- [ ] Valg mulighet for test originalfil - Kolonne *test* i Access 
- [ ] Loop for lagFilgruppe funksjon - kunne kjøre om natten med =tryCatch()=
- [X] Bytte =reshape2= pakke pga. pakken er ikke aktiv lenge
- [ ] Bruke *DBI* og *odbc* pakker istedenfor *RODBC* pga. Access nyeste versjon
- [ ] Lager R6 Class for Access connection 


