docs/log-dev.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="no" xml:lang="no">
<head>
<!-- 2020-10-21 ons. 17:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gjennomgang av KHFunction</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Gjennomgang av KHFunction</h1>
<div id="table-of-contents">
<h2>Innhold</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf6bdf9b">1. Generell info</a></li>
<li><a href="#org980a8e6">2. KHfunction_20200604_dev.R</a></li>
<li><a href="#org7d57012">3. <span class="todo TODO">TODO</span> Options <code>[1/3]</code></a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf6bdf9b" class="outline-2">
<h2 id="orgf6bdf9b"><span class="section-number-2">1</span> Generell info</h2>
<div class="outline-text-2" id="text-1">
<p>
Filen <code>khfun_dev.R</code> brukes og er en utvikling versjon for filen <code>khfunction.R</code>. Alternative å kunne
kjøre test gjøres ved å spesifisere følgende i <code>SePaaFil_dev.R</code> filen:
</p>
<ul class="org-ul">
<li><code>runtest=TRUE</code> for å bruke test kopi av Access DB</li>
<li><code>testfil=TRUE</code> i <code>LagFilgruppe</code> funksjon for å velge et spesifikk fil i original filer for testing</li>
</ul>
</div>
</div>
<div id="outline-container-org980a8e6" class="outline-2">
<h2 id="org980a8e6"><span class="section-number-2">2</span> KHfunction_20200604_dev.R</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Bytt <code>reshape2</code> pakke med <code>data.table::melt</code></li>
<li>Legg <code>test</code> arg i <code>LagFilgruppe</code> for å kunne velge originalfil for testing i <i>ORIGINALFILER</i> tabellen.</li>
<li>Lagt <code>ht2</code> funksjon for å vise <i>head</i> og <i>tail</i> i data.frame</li>
<li>Oppdatere kode</li>
</ul>
<div class="org-src-container">
<pre class="src src-R">if (TomRadSlutt = TRUE){
  ## OBS! restructure for checking
  ## -----------------------------
  ## Find where empty row starts
  totMiss &lt;- rowSums(DF == "")
  totNA &lt;- rowSums(is.na(DF))
  tomr1 &lt;- which(totMiss == ncol(DF))
  tomr2 &lt;- which(totNA == ncol(DF))
  tomr3 &lt;- c(tomr1, tomr2) #same as tomr below

  ## Alternativ with apply and faster
  tnames &lt;- rownames(DF[apply(is.na(DF) | DF == "", 1, all), ])
  tomr4 &lt;- DF[-(as.numeric(tnames)), ]
}

## Original code
tomr&lt;-which(rowSums(is.na(DF) | DF=="") == ncol(DF))
if (!is.na(tomr[1])){
  DF&lt;-DF[1:(tomr[1]-1),]
</pre>
</div>
</div>
</div>


<div id="outline-container-org7d57012" class="outline-2">
<h2 id="org7d57012"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Options <code>[1/3]</code></h2>
<div class="outline-text-2" id="text-3">
<p>
Disse skal implementeres etterhvert:
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Valg mulighet for test originalfil - Kolonne <b>test</b> i Access</li>
<li class="off"><code>[&#xa0;]</code> Loop for lagFilgruppe funksjon - kunne kjøre om natten med <code>tryCatch()</code></li>
<li class="on"><code>[X]</code> Bytte <code>reshape2</code> pakke pga. pakken er ikke aktiv lenge</li>
<li class="off"><code>[&#xa0;]</code> Bruke <b>DBI</b> og <b>odbc</b> pakker istedenfor <b>RODBC</b> pga. Access nyeste versjon</li>
<li class="off"><code>[&#xa0;]</code> Lager R6 Class for Access connection</li>
</ul>
</div>
</div>
</div>
</body>
</html>
